# Grouping Data

In this chapter, you'll learn how to identify and split DataFrames by groups or categories for further aggregation or analysis. You'll also learn how to transform and filter your data, including how to detect outliers and impute missing values. Knowing how to effectively group data in pandas can be a seriously powerful addition to your data science toolbox.

Categoricals and Groupby
- Advantages of categorical data types
- Grouping by Multiple Columns
- Grouping by another series

Groupby and Aggregation
- Computing multiple aggregates of multiple columns
- Aggregating on index levels/fields
- Grouping on function of the index

Groupby and Transformation
- Detecting outliers with z-scores
- Filling Missing Data (imputation) by group
- Other transformations with .apply

Groupby and filtering
- Grouping and filtering with .apply()
- Grouping and filtering with .filter()
- Filtering and Grouping with .map()

In [4]:
import pandas as pd
import numpy as np

# Categoricals and Groupby
- Advantages of categorical data types
- Grouping by Multiple Columns
- Grouping by another series

In [5]:
sales = pd.DataFrame(
    {
        'weekday':['Sun', 'Sun', 'Mon', 'Mon'],
        'city':['Austin', 'Dallas', 'Austin', 'Dallas'],
        'bread':[139, 237, 326,456],
        'butter':[20, 45, 70, 98]
    })

In [6]:
sales

   bread  butter    city weekday
0    139      20  Austin     Sun
1    237      45  Dallas     Sun
2    326      70  Austin     Mon
3    456      98  Dallas     Mon

In [8]:
# using filtering

sales.loc[sales['weekday']=='Sun'].count()

bread      2
butter     2
city       2
weekday    2
dtype: int64

In [10]:
# using groupby
# returns 'weekday' as the index
# count is an aggregation or reduction because it reduces many values
# into a single value

sales.groupby('weekday').count()

         bread  butter  city
weekday
Mon          2       2     2
Sun          2       2     2

### Aggregation/Reduction functions

- mean()
- std()
- sum()
- first(), last()
- min(), max()

In [13]:
# groupby but only interested in summing the bread column

sales.groupby('weekday')['bread'].sum()

weekday
Mon    782
Sun    376
Name: bread, dtype: int64

In [14]:
# show multiple columns - use a list

sales.groupby('weekday')['bread', 'butter'].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

## Multi-Level Groupby
pass multiple column in a list within groupby() function

In [16]:
# this creates a sorted Multi-Level Index

sales.groupby(['city', 'weekday']).mean()

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

## Groupby another series with same index values

You can use any pandas series with the same index values

Below, Customers series has the identical index length

In [22]:
customers = pd.Series(['Dave', 'Alice', 'Bob', 'Alice'])

customers

0     Dave
1    Alice
2      Bob
3    Alice
dtype: object

In [23]:
sales

   bread  butter    city weekday
0    139      20  Austin     Sun
1    237      45  Dallas     Sun
2    326      70  Austin     Mon
3    456      98  Dallas     Mon

In [24]:
#Creating new series with 

sales.groupby(customers)['bread'].sum()

Alice    693
Bob      326
Dave     139
Name: bread, dtype: int64

# Categorical values Unique()

transform object to categorical type.  Categoricals has 2 advantages

1. Uses Less memory
2. speeds up calculations on groupbys

behind the scenes, the Series entries are stored using small integers and a separate look up table.

In [25]:
sales['weekday'].unique()

array(['Sun', 'Mon'], dtype=object)

In [26]:
sales['weekday'] = sales['weekday'].astype('category')

In [27]:
sales['weekday']

0    Sun
1    Sun
2    Mon
3    Mon
Name: weekday, dtype: category
Categories (2, object): [Mon, Sun]

notice the above dtype = category.

#### Grouping by multiple columns

In this exercise, you will return to working with the Titanic dataset from Chapter 1 and use .groupby() to analyze the distribution of passengers who boarded the Titanic.

The 'pclass' column identifies which class of ticket was purchased by the passenger and the 'embarked' column indicates at which of the three ports the passenger boarded the Titanic. 'S' stands for Southampton, England, 'C' for Cherbourg, France and 'Q' for Queenstown, Ireland.

Your job is to first group by the 'pclass' column and count the number of rows in each class using the 'survived' column. You will then group by the 'embarked' and 'pclass' columns and count the number of passengers.

The DataFrame has been pre-loaded as titanic.

In [28]:
titanic = pd.read_csv('./data/titanic.csv')

In [29]:
by_class = titanic.groupby('pclass')

In [32]:
by_class['survived'].count()

pclass
1    323
2    277
3    709
Name: survived, dtype: int64

In [33]:
by_mult = titanic.groupby(['embarked', 'pclass'])

In [34]:
by_mult

In [36]:
count_mult = by_mult['survived'].count()

count_mult

embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: survived, dtype: int64

In [37]:
# Group titanic by 'pclass'
by_class = titanic.groupby('pclass')

# Aggregate 'survived' column of by_class by count
count_by_class = by_class['survived'].count()

# Print count_by_class
print(count_by_class)

# Group titanic by 'embarked' and 'pclass'
by_mult = titanic.groupby(['embarked', 'pclass'])

# Aggregate 'survived' column of by_mult by count
count_mult = by_mult['survived'].count()

# Print count_mult
print(count_mult)

pclass
1    323
2    277
3    709
Name: survived, dtype: int64
embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: survived, dtype: int64

Well done! Grouping your data by certain columns like this and aggregating them by another column, in this case, 'survived', allows you to carefully examine your data for interesting insights.

#### Grouping by another series

In this exercise, you'll use two data sets from Gapminder.org to investigate the average life expectancy (in years) at birth in 2010 for the 6 continental regions. To do this you'll read the life expectancy data per country into one pandas DataFrame and the association between country and region into another.

By setting the index of both DataFrames to the country name, you'll then use the region information to group the countries in the life expectancy DataFrame and compute the mean value for 2010.

The life expectancy CSV file is available to you in the variable life_fname and the regions filename is available in the variable regions_fname.

In [39]:
life = pd.read_csv('./data/gapminder_tidy.csv', index_col='Country')

In [40]:
life

,Year,fertility,life,population,child_mortality,gdp,region
Country,,,,,,,
Afghanistan,1964,7.671,33.639,10474903.0,339.7,1182.0,South Asia
Afghanistan,1965,7.671,34.152,10697983.0,334.1,1182.0,South Asia
Afghanistan,1966,7.671,34.662,10927724.0,328.7,1168.0,South Asia
Afghanistan,1967,7.671,35.170,11163656.0,323.3,1173.0,South Asia
Afghanistan,1968,7.671,35.674,11411022.0,318.1,1187.0,South Asia
Afghanistan,1969,7.671,36.172,11676990.0,313.0,1178.0,South Asia
Afghanistan,1970,7.671,36.663,11964906.0,307.8,1174.0,South Asia
Afghanistan,1971,7.671,37.143,12273101.0,302.1,1092.0,South Asia
Afghanistan,1972,7.671,37.614,12593688.0,296.4,1046.0,South Asia
Afghanistan,1973,7.671,38.075,12915499.0,290.8,1137.0,South Asia
Afghanistan,1974,7.671,38.529,13223928.0,284.9,1170.0,South Asia
Afghanistan,1975,7.671,38.977,13505544.0,279.4,1201.0,South Asia
Afghanistan,1976,7.670,39.417,13766792.0,273.6,1231.0,South Asia
Afghanistan,1977,7.670,39.855,14003408.0,267.8,1119.0,South Asia
Afghanistan,1978,7.670,40.298,14179656.0,261.6,1179.0,South Asia
Afghanistan,1979,7.669,40.756,14249493.0,255.5,1155.0,South Asia
Afghanistan,1980,7.669,41.242,14185729.0,249.1,1158.0,South Asia
Afghanistan,1981,7.670,41.770,13984092.0,242.7,1284.0,South Asia
Afghanistan,1982,7.671,42.347,13672870.0,236.2,1402.0,South Asia
Afghanistan,1983,7.673,42.977,13300056.0,229.7,1454.0,South Asia
Afghanistan,1984,7.676,43.661,12931791.0,222.9,1429.0,South Asia
Afghanistan,1985,7.679,44.400,12625292.0,216.0,1384.0,South Asia
Afghanistan,1986,7.681,45.192,12372113.0,209.2,1486.0,South Asia
Afghanistan,1987,7.682,46.024,12183387.0,202.1,1230.0,South Asia
Afghanistan,1988,7.682,46.880,12156685.0,195.0,1113.0,South Asia
Afghanistan,1989,7.682,47.744,12414686.0,187.8,1087.0,South Asia
Afghanistan,1990,7.687,48.601,13032161.0,181.0,1028.0,South Asia
Afghanistan,1991,7.700,49.439,14069854.0,174.2,1022.0,South Asia
Afghanistan,1992,7.725,50.247,15472076.0,167.8,941.0,South Asia
Afghanistan,1993,7.758,51.017,17053213.0,162.0,810.0,South Asia
...,...,...,...,...,...,...,...
Zimbabwe,1994,4.554,53.197,11469872.0,79.2,2456.0,Sub-Saharan Africa
Zimbabwe,1995,4.432,51.378,11684693.0,82.0,2416.0,Sub-Saharan Africa
Zimbabwe,1996,4.328,49.565,11891290.0,84.2,2619.0,Sub-Saharan Africa
Zimbabwe,1997,4.240,47.839,12086519.0,85.7,2645.0,Sub-Saharan Africa
Zimbabwe,1998,4.169,46.284,12261742.0,86.8,2680.0,Sub-Saharan Africa
Zimbabwe,1999,4.112,44.977,12405236.0,87.8,2625.0,Sub-Saharan Africa
Zimbabwe,2000,4.069,43.976,12509477.0,88.7,2521.0,Sub-Saharan Africa
Zimbabwe,2001,4.039,43.310,12575015.0,89.5,2540.0,Sub-Saharan Africa
Zimbabwe,2002,4.018,42.965,12607791.0,90.6,2304.0,Sub-Saharan Africa
Zimbabwe,2003,4.002,42.936,12612956.0,92.0,1908.0,Sub-Saharan Africa
Zimbabwe,2004,3.987,43.244,12597877.0,94.1,1794.0,Sub-Saharan Africa
Zimbabwe,2005,3.969,43.958,12570686.0,96.2,1689.0,Sub-Saharan Africa
Zimbabwe,2006,3.941,45.157,12529655.0,97.9,1629.0,Sub-Saharan Africa
Zimbabwe,2007,3.903,46.827,12481245.0,98.7,1568.0,Sub-Saharan Africa
Zimbabwe,2008,3.853,48.890,12451543.0,98.3,1286.0,Sub-Saharan Africa
Zimbabwe,2009,3.792,51.234,12473992.0,97.3,1352.0,Sub-Saharan Africa
Zimbabwe,2010,3.721,53.684,12571454.0,95.1,1484.0,Sub-Saharan Africa
Zimbabwe,2011,3.643,56.040,12754378.0,92.0,1626.0,Sub-Saharan Africa
Zimbabwe,2012,3.564,58.142,13013678.0,86.7,1750.0,Sub-Saharan Africa
Zimbabwe,2013,3.486,59.871,13327925.0,83.3,1773.0,Sub-Saharan Africa
Åland,1997,NaN,78.900,NaN,NaN,NaN,Europe & Central Asia
Åland,1998,NaN,81.000,NaN,NaN,NaN,Europe & Central Asia
Åland,1999,NaN,78.250,NaN,NaN,NaN,Europe & Central Asia
Åland,2000,NaN,80.000,25776.0,NaN,NaN,Europe & Central Asia
Åland,2001,NaN,80.830,26008.0,NaN,NaN,Europe & Central Asia
Åland,2002,NaN,81.800,26257.0,NaN,NaN,Europe & Central Asia
Åland,2003,NaN,80.630,26347.0,NaN,NaN,Europe & Central Asia
Åland,2004,NaN,79.880,26530.0,NaN,NaN,Europe & Central Asia
Åland,2005,NaN,80.000,26766.0,NaN,NaN,Europe & Central Asia
Åland,2006,NaN,80.100,26923.0,NaN,NaN,Europe & Central Asia

In [ ]:
# Read life_fname into a DataFrame: life
life = pd.read_csv(life_fname, index_col='Country')

# Read regions_fname into a DataFrame: regions
regions = pd.read_csv(regions_fname, index_col='Country')

# Group life by regions['region']: life_by_region
life_by_region = life.groupby(regions['region'])

# Print the mean over the '2010' column of life_by_region
print(life_by_region['2010'].mean())

# Groupby and Aggregation
- Computing multiple aggregates of multiple columns
- Aggregating on index levels/fields
- Grouping on function of the index

We can do several statistics for each group

Dispays multi-level index for the columns

Pass List [Max, Sum[ to AGG()

#### Agg method for standard statistics

In [41]:
sales.groupby('city')[['bread', 'butter']].agg(['max', 'sum'])

       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143

#### Agg method for custom functions

In [42]:
# this is an aggregation because it takes a series
# and returns a single number

def data_range(series):
    return series.max()-series.min()

In [44]:
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

#### Agg method for dictionaries

In [46]:
# Dictionary allows you to mix up bread for Total Sum
# and Butter for Max-Min Spread (data_range)

sales.groupby(customers)[['bread', 'butter']].agg({
    'bread':'sum',
    'butter':data_range
})

       bread  butter
Alice    693      53
Bob      326       0
Dave     139       0

#### Computing multiple aggregates of multiple columns

The .agg() method can be used with a tuple or list of aggregations as input. When applying multiple aggregations on multiple columns, the aggregated DataFrame has a multi-level column index.

In this exercise, you're going to group passengers on the Titanic by 'pclass' and aggregate the 'age' and 'fare' columns by the functions 'max' and 'median'. You'll then use multi-level selection to find the oldest passenger per class and the median fare price per class.

The DataFrame has been pre-loaded as titanic.

In [47]:
# Group titanic by 'pclass': by_class
by_class = titanic.groupby('pclass')

# Select 'age' and 'fare'
by_class_sub = by_class[['age','fare']]

# Aggregate by_class_sub by 'max' and 'median': aggregated
aggregated = by_class_sub.agg(['max', 'median'])

# Print the maximum age in each class
print(aggregated.loc[:, ('age','max')])

# Print the median fare in each class
print(aggregated.loc[:, ('fare', 'median')])

pclass
1    80.0
2    70.0
3    74.0
Name: (age, max), dtype: float64
pclass
1    60.0000
2    15.0458
3     8.0500
Name: (fare, median), dtype: float64

In [51]:
aggregated

         age             fare
         max median       max   median
pclass
1       80.0   39.0  512.3292  60.0000
2       70.0   29.0   73.5000  15.0458
3       74.0   24.0   69.5500   8.0500

#### Aggregating on index levels/fields

If you have a DataFrame with a multi-level row index, the individual levels can be used to perform the groupby. This allows advanced aggregation techniques to be applied along one or more levels in the index and across one or more columns.

In this exercise you'll use the full Gapminder dataset which contains yearly values of life expectancy, population, child mortality (per 1,000) and per capita gross domestic product (GDP) for every country in the world from 1964 to 2013.

Your job is to create a multi-level DataFrame of the columns 'Year', 'Region' and 'Country'. Next you'll group the DataFrame by the 'Year' and 'Region' levels. Finally, you'll apply a dictionary aggregation to compute the total population, spread of per capita GDP values and average child mortality rate.

The Gapminder CSV file is available as 'gapminder.csv'.

In [56]:
gapminder = pd.read_csv('./data/gapminder_tidy.csv', index_col=['Year', 'region', 'Country'])

In [57]:
gapminder.columns

Index(['fertility', 'life', 'population', 'child_mortality', 'gdp'], dtype='object')

In [61]:
# Group gapminder by 'Year' and 'region': by_year_region
by_year_region = gapminder.groupby(level=['Year', 'region'])

# Define the function to compute spread: spread
def spread(series):
    return series.max() - series.min()

# Create the dictionary: aggregator
aggregator = {'population':'sum', 
              'child_mortality':'mean', 
              'gdp':spread}

# Aggregate by_year_region using the dictionary: aggregated
aggregated = by_year_region.agg(aggregator)

# Print the last 6 entries of aggregated 
print(aggregated.tail(6))

                                   population  child_mortality       gdp
Year region
2013 America                     9.629087e+08        17.745833   49634.0
     East Asia & Pacific         2.244209e+09        22.285714  134744.0
     Europe & Central Asia       8.968788e+08         9.831875   86418.0
     Middle East & North Africa  4.030504e+08        20.221500  128676.0
     South Asia                  1.701241e+09        46.287500   11469.0
     Sub-Saharan Africa          9.205996e+08        76.944490   32035.0

Excellent work! Are you able to see any correlations between population, child_mortality, and gdp?

#### Grouping on a function of the index

Groupby operations can also be performed on transformations of the index values. In the case of a DateTimeIndex, we can extract portions of the datetime over which to group.

In this exercise you'll read in a set of sample sales data from February 2015 and assign the 'Date' column as the index. Your job is to group the sales data by the day of the week and aggregate the sum of the 'Units' column.

Is there a day of the week that is more popular for customers? To find out, you're going to use .strftime('%a') to transform the index datetime values to abbreviated days of the week.

The sales data CSV file is available to you as 'sales.csv'.

In [69]:
# Read file: sales
sales = pd.read_csv('./data/sales-feb-2015.csv', index_col='Date', parse_dates=True)

In [71]:
# Create a groupby object: by_day
by_day = sales.groupby(sales.index.strftime('%a'))

# Create sum: units_sum
units_sum = by_day['Units'].sum()

# Print units_sum
print(units_sum)

Mon    48
Sat     7
Thu    59
Tue    13
Wed    48
Name: Units, dtype: int64

Well done! It looks like Monday, Wednesday, and Thursday were the most popular days for customers!

# Groupby and Transformation
- Detecting outliers with z-scores
- Filling Missing Data (imputation) by group
- Other transformations with .apply